rails-review-full-completed/app/views/purchases/new.html.erb

SELECT "brews".* FROM "brews"
---
  <%=f.number_field :price, step: 0.01%>
  <%=f.collection_select :brew_id, Brew.all, :id, :blend_name%>