rails-review-full-completed/app/models/brew.rb

  def self.strongest
    Brew.all.order(:strength).last(5).reverse
---
SELECT  "brews".* FROM "brews" ORDER BY "brews"."strength" DESC LIMIT ?  [["LIMIT", 5]]