rails-review-full-completed/app/controllers/brews_controller.rb

SELECT "brews".* FROM "brews"
---
  def index
    @brews = Brew.all

INSERT INTO "brews" ("blend_name", "origin", "notes", "strength", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @brew = Brew.new(brew_params)
    if @brew.save

UPDATE "brews" SET "strength" = ?, "updated_at" = ? WHERE "brews"."id" = ?  [["strength", 10000], ["updated_at", "2019-12-19 23:26:33.348014"], ["id", 26]]
---
  def update
    @brew.update(brew_params)

DELETE FROM "brews" WHERE "brews"."id" = ?  [["id", 1]]
---
  def destroy
    @brew.destroy

SELECT  "brews".* FROM "brews" WHERE "brews"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def find_brew
      @brew = Brew.find(params[:id])